# Initialize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IEntryPoint..::..Initialize Method
IEntryPoint Interface See Also
---
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
void Initialize(
	Object obj,
	string addinFolder
)
```

Visual Basic
---
```text
Sub Initialize ( _
	obj As Object, _
	addinFolder As String _
)
```

Visual C++
---
```text
void Initialize(
	Object^ obj,
	String^ addinFolder
)
```

# ### Parameters
obj
    Type: System..::..Object
addinFolder
    Type: System..::..String
# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace